* No derailment (Move between segments)
** Elapsed time
|-------------------------+----------+----------+----------+-------------|
| Configuration           |    First |   Second |    Third |     Average |
|-------------------------+----------+----------+----------+-------------|
| Example with one train  |    0.005 |    0.004 |    0.003 |        4e-3 |
| Example with two trains |    0.036 |    0.046 |    0.040 | 0.040666667 |
| Shared Segment          |    0.014 |    0.014 |    0.016 | 0.014666667 |
| Large Network           |    0.019 |    0.018 |    0.017 |       0.018 |
| Station One             |    0.015 |    0.018 |    0.018 |       0.017 |
| Station Two             |    0.125 |    0.133 |    0.149 |  0.13566667 |
| Station Four            |    2.321 |    2.735 |    2.390 |       2.482 |
| Station Six             |   46.617 |   45.514 |   45.616 |   45.915667 |
| Station Eight           |  276.247 |  276.290 |  277.621 |   276.71933 |
| Station Ten             | 1019.511 | 1017.561 | 1002.800 |   1013.2907 |
| Nærumbanen (2T)         |   30.402 |   31.323 |   30.141 |      30.622 |
| Nærumbanen (3T)         |  609.778 |  609.493 |  608.663 |   609.31133 |
|-------------------------+----------+----------+----------+-------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+---------+---------+---------+-----------|
| Configuration           |   First |  Second |   Third |   Average |
|-------------------------+---------+---------+---------+-----------|
| Example with one train  |   7.656 |   7.676 |   7.676 | 7.6693333 |
| Example with two trains |   8.404 |   8.412 |   8.420 |     8.412 |
| Shared Segment          |   9.924 |   9.956 |   9.960 | 9.9466667 |
| Large Network           |  11.924 |  11.972 |  11.980 | 11.958667 |
| Station One             |   8.360 |   8.364 |   8.372 | 8.3653333 |
| Station Two             |  12.254 |  12.572 |  12.584 |     12.47 |
| Station Four            |  37.716 |  37.956 |  37.964 | 37.878667 |
| Station Six             | 103.552 | 104.284 | 104.372 | 104.06933 |
| Station Eight           | 231.528 | 233.348 | 233.428 |   232.768 |
| Station Ten             | 451.236 | 454.584 | 451.232 | 452.35067 |
| Nærumbanen (2T)         | 113.668 | 114.688 | 114.792 | 114.38267 |
| Nærumbanen (3T)         | 309.836 | 310.420 | 310.736 | 310.33067 |
|-------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Critical section)
** Elapsed time
|-------------------------+----------+----------+----------+--------------|
| Configuration           |    First |   Second |    Third |      Average |
|-------------------------+----------+----------+----------+--------------|
| Example with one train  |    0.004 |    0.004 |    0.005 | 4.3333333e-3 |
| Example with two trains |    0.026 |    0.027 |    0.051 |  0.034666667 |
| Shared Segment          |    0.021 |    0.020 |    0.022 |        0.021 |
| Large Network           |    0.016 |    0.017 |    0.027 |         0.02 |
| Station One             |    0.022 |    0.021 |    0.025 |  0.022666667 |
| Station Two             |    0.125 |    0.134 |    0.164 |        0.141 |
| Station Four            |    2.394 |    2.338 |    2.348 |         2.36 |
| Station Six             |   45.077 |   44.229 |   45.653 |    44.986333 |
| Station Eight           |  289.866 |  288.213 |  288.014 |    288.69767 |
| Station Ten             | 1027.780 | 1021.841 | 1022.455 |    1024.0253 |
| Nærumbanen (2T)         |   29.375 |   29.997 |   29.294 |    29.555333 |
| Nærumbanen (3T)         |  634.538 |  625.064 |  623.036 |      627.546 |
|-------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+---------+---------+---------+-----------|
| Configuration           |   First |  Second |   Third |   Average |
|-------------------------+---------+---------+---------+-----------|
| Example with one train  |   7.648 |   7.668 |   7.668 | 7.6613333 |
| Example with two trains |   8.384 |   8.408 |   8.416 | 8.4026667 |
| Shared Segment          |   9.904 |   9.932 |   9.936 |     9.924 |
| Large Network           |  11.924 |  11.968 |  11.980 | 11.957333 |
| Station One             |   8.328 |   8.356 |   8.360 |     8.348 |
| Station Two             |  12.516 |  12.564 |  12.572 | 12.550667 |
| Station Four            |  37.712 |  37.952 |  37.360 | 37.674667 |
| Station Six             | 103.552 | 104.280 | 104.360 |   104.064 |
| Station Eight           | 231.512 | 233.328 | 233.400 | 232.74667 |
| Station Ten             | 451.224 | 454.576 | 454.584 | 453.46133 |
| Nærumbanen (2T)         | 111.964 | 112.992 | 113.096 |   112.684 |
| Nærumbanen (3T)         | 309.812 | 310.700 | 310.728 | 310.41333 |
|-------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
|-------------------------+----------+----------+----------+-------------|
| Configuration           |    First |   Second |    Third |     Average |
|-------------------------+----------+----------+----------+-------------|
| Example with one train  |    0.004 |    0.004 |    0.004 |        4e-3 |
| Example with two trains |    0.036 |    0.034 |    0.042 | 0.037333333 |
| Shared Segment          |    0.020 |    0.019 |    0.020 | 0.019666667 |
| Large Network           |    0.019 |    0.027 |    0.025 | 0.023666667 |
| Station One             |    0.025 |    0.015 |    0.025 | 0.021666667 |
| Station Two             |    0.125 |    0.129 |    0.128 |  0.12733333 |
| Station Four            |    2.685 |    2.651 |    2.694 |   2.6766667 |
| Station Six             |   44.791 |   45.379 |   44.759 |   44.976333 |
| Station Eight           |  286.995 |  287.993 |  285.826 |     286.938 |
| Station Ten             | 1022.700 | 1029.362 | 1027.356 |   1026.4727 |
| Nærumbanen (2T)         |   27.643 |   28.318 |   28.409 |   28.123333 |
| Nærumbanen (3T)         |  589.217 |  596.547 |  592.764 |   592.84267 |
|-------------------------+----------+----------+----------+-------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+---------+---------+---------+-----------|
| Configuration           |   First |  Second |   Third |   Average |
|-------------------------+---------+---------+---------+-----------|
| Example with one train  |   7.632 |   7.652 |   7.656 | 7.6466667 |
| Example with two trains |   8.392 |   8.400 |   8.408 |       8.4 |
| Shared Segment          |   9.900 |   9.936 |  10.192 | 10.009333 |
| Large Network           |  11.920 |  11.972 |  11.980 | 11.957333 |
| Station One             |   8.344 |   8.352 |   8.360 |     8.352 |
| Station Two             |  12.504 |  12.560 |  12.572 | 12.545333 |
| Station Four            |  37.696 |  37.892 |  37.948 | 37.845333 |
| Station Six             | 103.528 | 104.260 | 104.352 | 104.04667 |
| Station Eight           | 231.500 | 233.320 | 233.340 |    232.72 |
| Station Ten             | 451.224 | 454.576 | 454.680 | 453.49333 |
| Nærumbanen (2T)         | 111.960 | 112.988 | 112.996 |   112.648 |
| Nærumbanen (3T)         | 309.820 | 310.408 | 310.736 | 310.32133 |
|-------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
|-------------------------+----------+----------+----------+--------------|
| Configuration           |    First |   Second |    Third |      Average |
|-------------------------+----------+----------+----------+--------------|
| Example with one train  |    0.003 |    0.004 |    0.003 | 3.3333333e-3 |
| Example with two trains |    0.037 |    0.048 |    0.045 |  0.043333333 |
| Shared Segment          |    0.021 |    0.021 |    0.021 |        0.021 |
| Large Network           |    0.015 |    0.016 |    0.020 |        0.017 |
| Station One             |    0.025 |    0.025 |    0.025 |        0.025 |
| Station Two             |    0.124 |    0.137 |    0.133 |   0.13133333 |
| Station Four            |    2.578 |    2.538 |    2.654 |         2.59 |
| Station Six             |   46.681 |   46.718 |   47.014 |    46.804333 |
| Station Eight           |  285.616 |  285.069 |  285.284 |      285.323 |
| Station Ten             | 1012.653 | 1003.455 | 1008.457 |    1008.1883 |
| Nærumbanen (2T)         |   28.386 |   28.808 |   28.951 |       28.715 |
| Nærumbanen (3T)         |  642.802 |  642.096 |  635.737 |    640.21167 |
|-------------------------+----------+----------+----------+--------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-------------------------+---------+---------+---------+-----------|
| Configuration           |   First |  Second |   Third |   Average |
|-------------------------+---------+---------+---------+-----------|
| Example with one train  |   7.572 |   7.580 |   7.580 | 7.5773333 |
| Example with two trains |   8.316 |   8.316 |   8.316 |     8.316 |
| Shared Segment          |   9.828 |   9.848 |   9.852 | 9.8426667 |
| Large Network           |  11.856 |  11.856 |  11.856 |    11.856 |
| Station One             |   8.268 |   8.268 |   8.268 |     8.268 |
| Station Two             |  12.428 |  12.468 |  12.480 | 12.458667 |
| Station Four            |  37.624 |  37.808 |  37.816 | 37.749333 |
| Station Six             | 103.380 | 103.724 | 104.060 | 103.72133 |
| Station Eight           | 231.172 | 232.936 | 233.012 | 232.37333 |
| Station Ten             | 452.100 | 455.184 | 455.188 | 454.15733 |
| Nærumbanen (2T)         | 111.888 | 112.812 | 112.820 | 112.50667 |
| Nærumbanen (3T)         | 309.736 | 310.312 | 310.464 | 310.17067 |
|-------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)
